Tekla Open API Reference for Tekla Structures 2025
Dialogs.LoadAttributeFileNameToDialogAndApply Method
Overload List
Name | Description
LoadAttributeFileNameToDialogAndApply(String)
 Uses the attributes found from the attribute file as the applied values for the specified dialog.
LoadAttributeFileNameToDialogAndApply(String, String)
 Loads the specified dialog's applied values from the attribute file.
Top
See Also
Reference
Dialogs Class
Tekla.Structures.Dialog Namespace